Repository: aronowen/prompty
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: Prompt Scoring Arcade
cy: Arcêd Sgorio Prydlon

source: Home
cy: Cartref

source: Team
cy: Tîm

source: Leaderboard
cy: Bwrdd Arweinwyr

source: Customer Support Agent Scenario
cy: Senario Asiant Cymorth Cwsmeriaid

source: Craft a strong prompt as if you were briefing an AI to help draft a calm, clear response to a frustrated customer.
cy: Crefftwch awgrym cryf fel petaech chi'n briffio AI i helpu i ddrafftio tawelwch, ymateb clir i gwsmer rhwystredig.

source: Your role: Customer Support Agent
cy: Eich rôl: Asiant Cymorth Cwsmeriaid

source: Scenario
cy: Senario

source: You are a Customer Support Agent for a subscription-based productivity app used by freelancers and small teams. A long-time customer has sent an angry email after their account was unexpectedly locked due to non-payment caused by an expired card.
cy: Rydych chi’n Asiant Cymorth Cwsmeriaid ar gyfer ap cynhyrchiant ar sail tanysgrifiad a ddefnyddir gan weithwyr llawrydd a thimau bach. Mae cwsmer hirdymor wedi anfon e-bost dig ar ôl i’w gyfrif gael ei gloi’n annisgwyl oherwydd diffyg taliad a achoswyd gan gerdyn sydd wedi dod i ben.

source: In their message, the customer explains that they rely on the app daily to run their business, express frustration that they received no useful warning before being locked out, mention that they have an urgent deadline and are losing money as a result, and threaten to cancel their subscription and leave a negative review.
cy: Yn eu neges, mae’r cwsmer yn esbonio eu bod yn dibynnu ar yr ap bob dydd i redeg eu busnes, yn mynegi rhwystredigaeth nad oedden nhw wedi cael unrhyw rybudd defnyddiol cyn cael eu cloi allan, yn sôn bod ganddyn nhw ddyddiad cau brys ac eu bod yn colli arian o ganlyniad, ac yn bygwth canslo eu tanysgrifiad a gadael adolygiad negyddol.

source: After checking the account, you confirm that two payment attempts failed because of an expired card, automated reminder emails were sent but may have landed in spam, and you are authorised to offer a one-time goodwill credit along with temporary reactivation of the account.
cy: Ar ôl gwirio’r cyfrif, rydych chi’n cadarnhau i ddau ymgais talu fethu oherwydd cerdyn sydd wedi dod i ben, anfonwyd e-byst atgoffa awtomataidd ond mae’n bosib eu bod wedi mynd i’r sbam, ac rydych chi’n cael cynnig credyd ewyllys da unwaith ynghyd ag ail-ysgogi dros dro ar y cyfrif.

source: Your task is to write a prompt that you would give to an AI assistant to help you draft a reply to this customer. The response should acknowledge their frustration, apologise appropriately, explain what happened in plain non-technical language, offer a concrete resolution such as temporary reactivation and steps to update billing, and reassure them about what will happen next and how they can avoid similar issues in the future.
cy: Dyma’ch tasg: ysgrifennu ciwb y byddech chi’n ei roi i gynorthwyydd AI i’ch helpu i lunio ymateb i’r cwsmer hwn. Dylai’r ymateb gydnabod eu rhwystredigaeth, ymddiheuro’n briodol, egluro beth ddigwyddodd mewn iaith syml, ddim yn dechnegol, cynnig ateb pendant megis ail-ysgogi dros dro a chamau i ddiweddaru bilio, ac yna eu sicrhau ynghylch beth fydd yn digwydd nesaf a sut y gallan nhw osgoi problemau tebyg yn y dyfodol.

source: Your prompt should give the AI clear context about the situation, the tone you want to achieve—calm, empathetic, and professional—and include any constraints such as desired length, structure, phrases to avoid, or internal policy limits that the AI must respect.
cy: Dylai eich ciwb roi cyd-destun clir i’r AI am y sefyllfa, y naws rydych chi am ei chyflawni—tawel, empathig ac yn broffesiynol—ac gynnwys unrhyw gyfyngiadau megis hyd dymunol, strwythur, ymadroddion i’w hosgoi, neu gyfyngiadau polisi mewnol y mae’n rhaid i’r AI eu parchu.

source: We’ll score how well your prompt guides the AI to respond with empathy and clarity.
cy: Byddwn yn sgorio pa mor dda mae eich ciwb yn arwain yr AI i ymateb gyda chydymdeimlad ac eglurder.

source: Your name
cy: Eich enw

source: Your AI prompt
cy: Eich ciwb AI

source: describe the support reply you want the AI to draft
cy: disgrifiwch yr ymateb cymorth rydych chi am i’r AI ei lunio

source: Submit prompt for scoring ⮕
cy: Cyflwyno'r ciwb i’w sgorio ⮕

source: Prompt Scoring Arcade · v0.1
cy: Arcêd Sgorio Ciwbiau · f0.1

source: Copywriter · Prompt Scoring Arcade
cy: Copïwr · Arcêd Sgorio Ciwbiau

source: Craft a strong prompt as if you were briefing an AI to write a launch email and landing page copy.
cy: Crewch giwb cryf fel pe baech yn briffio AI i ysgrifennu e-bost lansio a chopi tudalen lanio.

source: You are a Copywriter for a small but growing SaaS company that helps freelancers and agencies manage their clients, proposals, and invoices in one place. The team is about to launch a new Client Portal feature.
cy: Rydych chi’n Gopïwr ar gyfer cwmni SaaS bach sy’n tyfu ac sy’n helpu gweithwyr llawrydd ac asiantaethau i reoli eu cleientiaid, eu cynnig cynigion a’u hanfonebau i gyd mewn un lle. Mae’r tîm ar fin lansio nodwedd Portal Cleient newydd.

source: The Client Portal allows customers to share project timelines, files, and updates in one secure space, enable clients to approve proposals and sign documents online, reduce back-and-forth email threads and missed attachments, and give clients a single place to see what’s happening next.
cy: Mae’r Portal Cleient yn caniatáu i gwsmeriaid rannu llinellau amser prosiect, ffeiliau a diweddariadau mewn un gofod diogel; galluogi cleientiaid i gymeradwyo cynigion ac arwyddo dogfennau ar-lein; lleihau edafedd e-byst yn ôl ac ymlaen a ffeiliau cysylltiedig a gollwyd; ac yn rhoi un lle clir i gleientiaid weld beth sy’n dod nesaf.

source: You need to brief an AI assistant to help you draft both a launch email for existing customers announcing the Client Portal and the key sections of a landing page, including the headline, subheading, benefits, and call to action.
cy: Mae angen i chi friffio cynorthwyydd AI i’ch helpu i lunio e-bost lansio ar gyfer cwsmeriaid presennol yn cyhoeddi’r Portal Cleient, ynghyd â phrif adrannau tudalen lanio gan gynnwys y pennawd, yr is-bennawd, y manteision a’r alwad i weithredu.

source: The audience is time-poor freelancers and small agencies who juggle multiple clients and dislike admin. The tone should be clear, energetic, and reassuring, emphasising saving time, reducing chaos, and helping them appear more professional to their clients.
cy: Y gynulleidfa yw gweithwyr llawrydd a chwmnïau bach sy’n brin o amser, yn rheoli nifer o gleientiaid ac yn casáu gwaith papur. Dylai’r naws fod yn glir, egniol ac yn dawelgar—yn pwysleisio arbed amser, lleihau anhrefn ac eu helpu i ymddangos yn fwy proffesiynol i’w cleientiaid.

source: Your task is to write a prompt that you would give to the AI assistant to generate this email and landing page copy. Your prompt should include clear context about the product and audience, the goals of the campaign, and constraints such as tone of voice, structure, word count ranges, and any phrases or clichés to avoid.
cy: Eich tasg yw ysgrifennu ciwb y byddech yn ei roi i’r cynorthwyydd AI i gynhyrchu’r e-bost a’r copi tudalen lanio. Dylai’ch ciwb gynnwys cyd-destun clir am y cynnyrch a’r gynulleidfa, nodau’r ymgyrch, a chyfyngiadau megis naws yr iaith, strwythur, ystod hyd geiriau, ac unrhyw ymadroddion neu glisheu i’w hosgoi.

source: Hint: Imagine you’re briefing a junior copywriter. What do they need so the first draft feels “on brand” and requires only light editing?
cy: Awgrym: Dychmygwch eich bod yn briffio copiwr iau. Beth fyddai ei angen arnynt fel bod y drafft cyntaf yn teimlo’n “on brand” ac yn gofyn am olygu ysgafn yn unig?

source: Your role: Data Analyst
cy: Eich rôl: Dadansoddwr Data

source: Scenario · Reporting · Stakeholder Comms
cy: Senario · Adrodd · Cyfathrebu â Rhanddeiliaid

source: You are a Data Analyst at a growing SaaS company that provides a web platform for small businesses. Each month you produce a Product Usage and Adoption Dashboard that tracks how actively customers are engaging with key features.
cy: Rydych chi’n Ddadansoddwr Data mewn cwmni SaaS sy’n tyfu ac sy’n darparu platfform gwe i fusnesau bach. Bob mis rydych chi’n cynhyrchu Dangosiad Defnydd a Mabwysiadu Cynnyrch sy’n olrhain pa mor weithgar mae cwsmeriaid yn ymgysylltu â nodweddion allweddol.

source: This month’s dashboard highlights several notable patterns. Overall logins have increased, but one of the core product features has experienced a clear and meaningful drop in usage. New customers appear to be adopting key features more quickly than long-term customers, and churn risk is rising within a particular customer segment. Additionally, a recent UX change seems to have altered behaviour across two major user flows.
cy: Mae dangosiad mis hwn yn tynnu sylw at sawl patrwm nodedig. Mae mewngofnodion cyffredinol wedi cynyddu, ond mae un nodwedd graidd wedi gweld gostyngiad amlwg yn ei defnydd. Mae cwsmeriaid newydd yn ymddangos yn fwy cyflym i fabwysiadu nodweddion allweddol na chwsmeriaid tymor hir, ac mae’r risg chwalu’n cynyddu mewn un segment penodol. Yn ogystal, mae newid diweddar yn y profiad defnyddiwr wedi newid ymddygiad ar draws dwy llif ddefnyddwyr.

source: Your task is to send a summary update to the leadership team and product managers. In this update you should explain what trends you observe in the data, why these trends matter for the business, and what potential decisions, risks, or follow-up questions emerge from the patterns you have identified.
cy: Eich tasg yw anfon crynodeb at y tîm arweinyddiaeth a’r rheolwyr cynnyrch. Dylech egluro pa dueddiadau sy’n ymddangos yn y data, pam eu bod yn bwysig i ’r busnes, a pha benderfyniadau, risgiau neu gwestiynau dilynol sy’n codi o’r patrymau hynny.

source: Write a prompt that you would give to an AI assistant to help you draft this summary. Your prompt should include clear context about the dashboard, the intended audience of non-technical leaders, and specific instructions about the structure of the summary, such as highlighting key insights, explaining the impact, and suggesting recommended next steps.
cy: Ysgrifennwch giwb y byddech yn ei roi i gynorthwyydd AI i’ch helpu i lunio’r crynodeb hwn. Dylai’ch ciwb gynnwys cyd-destun clir am y dangosiad, y gynulleidfa darged o arweinwyr annechnegol, ac yn ogystal cyfarwyddiadau penodol ar strwythur y crynodeb, gan gynnwys prif fewnwelediadau, effaith, a chamau nesaf argymelledig.

source: Hint: Imagine you are briefing a consultant who has never seen your product or dataset before. What information would they need to produce a clear, confident, and actionable summary?
cy: Awgrym: Dychmygwch eich bod yn briffio ymgynghorydd nad yw erioed wedi gweld eich cynnyrch na’ch set ddata o’r blaen. Pa wybodaeth fyddai’n angenrheidiol iddo gynhyrchu crynodeb clir, hyderus ac ymarferol?

source: Select a role, drop in a prompt, and let the retro engine score your skills.
cy: Dewiswch rôl, rhowch giwb i mewn, a gadewch i'r peiriant retro sgorio’ch sgiliau.

source: Choose your role
cy: Dewiswch eich rôl

source: Pick a lane below or let fate decide with the <span class="highlight">Random Role</span>.
cy: Dewiswch lôn isod neu gadewch i dynged benderfynu gyda'r <span class="highlight">Rôl Ar Hap</span>.

source: HR Manager
cy: Rheolwr Adnoddau Dynol

source: Score prompts for recruitment, performance reviews, and tricky people problems.
cy: Sgorïwch giwbiau ar gyfer recriwtio, adolygiadau perfformiad, a sefyllfaoedd pobl anodd.

source: Load HR arena ⮕
cy: Llwytho arena AD ⮕

source: Data Analyst
cy: Dadansoddwr Data

source: Evaluate prompts that explain dashboards, trends, and gnarly spreadsheets.
cy: Gwerthuswch giwbiau sy’n egluro dangosfyrddau, tueddiadau a thaflenni cymhleth.

source: Load data arena ⮕
cy: Llwytho arena data ⮕

source: Marketing Strategist
cy: Strategaethydd Marchnata

source: Judge prompts for campaigns, landing pages, and social copy that actually converts.
cy: Barnwch giwbiau ar gyfer ymgyrchoedd, tudalennau glanio a chopïau cymdeithasol sy’n trosi’n wirioneddol.

source: Load marketing arena ⮕
cy: Llwytho arena marchnata ⮕

source: Product Designer
cy: Dylunydd Cynnyrch

source: Assess prompts for UX flows, user research, and delightful microcopy.
cy: Aseswch giwbiau ar gyfer llifau UX, ymchwil defnyddwyr a microgopi hyfryd.

source: Load design arena ⮕
cy: Llwytho arena dylunio ⮕

source: Customer Support Agent
cy: Asiant Cymorth Cwsmeriaid

source: Rate prompts that handle complaints, refunds, and “have you tried turning it off?”.
cy: Sgorïwch giwbiau sy’n delio â chwynion, ad-daliadau, ac “ydych chi wedi trio ei ddiffodd ac ymlaen eto?”.

source: Load support arena ⮕
cy: Llwytho arena cymorth ⮕

source: Copywriter
cy: Ysgrifennwr Copi

source: Score prompts for taglines, email sequences, and content that actually sounds human.
cy: Sgorïwch giwbiau ar gyfer sloganau, dilyniannau e-bost, a chynnwys sy’n swnio’n wirioneddol ddynol.

source: Load copy arena ⮕
cy: Llwytho arena copi ⮕

source: IT Specialist
cy: Arbenigwr TG

source: Evaluate prompts for troubleshooting, documentation, and “my printer is possessed”.
cy: Gwerthuswch giwbiau ar gyfer datrys problemau, dogfennau, ac “mae fy argraffydd wedi’i feddiannu”.

source: Load IT arena ⮕
cy: Llwytho arena TG ⮕

source: Random Role
cy: Rôl Ar Hap

source: Let the arcade pick one of the seven roles at random and throw you straight into the challenge.
cy: Gadewch i’r arcêd ddewis un o’r saith rôl ar hap a’ch taflu’n syth i’r her.

source: I’m feeling lucky ⮕
cy: Rwy’n teimlo’n ffodus ⮕

source: Your role: HR Manager
cy: Eich rôl: Rheolwr Adnoddau Dynol

source: Scenario · Internal Comms · AI Adoption
cy: Senario · Cyfathrebu Mewnol · Mabwysiadu AI

source: You are the HR Manager at a mid-sized tech company with around 120 employees working across engineering, product, sales, and operations. Next month, the organisation is running its first ever AI Application Day—a full-day internal event where staff can learn about AI tools, experiment with them, and propose ideas for how AI could improve their workflows.
cy: Rydych chi’n Rheolwr Adnoddau Dynol mewn cwmni technoleg canolig ei faint gyda thua 120 o staff ar draws peirianneg, cynnyrch, gwerthu a gweithrediadau. Mis nesaf, mae’r sefydliad yn cynnal ei Ddiwrnod AI cyntaf erioed—diwrnod llawn i staff ddysgu am offer AI, profi syniadau, a chynnig ffyrdd o wella llif gwaith drwy AI.

source: Write a prompt that you would give to an AI assistant to help you produce this email. Your prompt should include clear context, specific instructions, and relevant constraints such as tone, length, and audience so that the AI can generate a high-quality first draft.
cy: Ysgrifennwch giwb y byddech yn ei roi i gynorthwyydd AI i greu’r e-bost. Dylai’ch ciwb gynnwys cyd-destun clir, cyfarwyddiadau penodol a chyfyngiadau megis naws, hyd ac awdurdod fel y gall yr AI gynhyrchu drafft cyntaf o safon uchel.

source: Hint: Imagine you are delegating this task to a junior colleague who does not yet know the company well. What information would they need to get the email right on the first attempt?
cy: Awgrym: Dychmygwch eich bod yn dirprwyo’r dasg hon i gydweithiwr newydd nad yw’n adnabod y cwmni’n dda eto. Pa wybodaeth fyddai ei hangen arnynt i gael yr e-bost yn iawn y tro cyntaf?

source: We will score how well your prompt guides the AI to respond with empathy and clarity.
cy: Byddwn yn sgorio pa mor dda mae eich ciwb yn arwain yr AI i ymateb gyda chydymdeimlad ac eglurder.

source: Your role: IT Specialist
cy: Eich rôl: Arbenigwr TG

source: Scenario · System Upgrade · Internal Comms
cy: Senario · Uwchraddio System · Cyfathrebu Mewnol

source: You are an IT Specialist at a mid-sized organisation with around 250 staff working both in the office and remotely. Your team is preparing to roll out a major system upgrade that affects the company’s core tools, including email, file storage, and VPN access.
cy: Rydych chi’n Arbenigwr TG mewn sefydliad canolig ei faint gyda thua 250 o staff yn gweithio yn y swyddfa ac o bell. Mae eich tîm yn paratoi i gyflwyno uwchraddiad system mawr sy’n effeithio ar brif offer y cwmni, gan gynnwys e-bost, storio ffeiliau a mynediad VPN.

source: The upcoming upgrade introduces several important improvements. Users will benefit from enhanced security through mandatory two-factor authentication, along with a cleaner and faster webmail interface. File storage and sharing rules will be updated to improve consistency and safety across the organisation. In addition, there will be short periods of planned downtime over a single weekend to complete the upgrade safely.
cy: Bydd yr uwchraddiad yn cyflwyno sawl gwelliant pwysig. Bydd defnyddwyr yn elwa ar ddiogelwch uwch drwy ddilysu dau gam gorfodol, ynghyd ag wyneb we e-bost glanach a chyflymach. Bydd y rheolau ar gyfer storio a rhannu ffeiliau’n cael eu diweddaru i wella cysondeb a diogelwch ar draws y sefydliad. Yn ogystal, bydd cyfnodau byr o ddiffodd wedi’u cynllunio dros un penwythnos i gwblhau’r uwchraddiad yn ddiogel.

source: You are aware that many of your colleagues are not technical and may feel overwhelmed by system changes. Some may ignore long or complicated emails, and others may miss critical instructions unless the information is presented in a clear, structured, and approachable way.
cy: Rydych yn ymwybodol nad yw llawer o’ch cydweithwyr yn dechnegol ac efallai y byddan nhw’n teimlo’n llethu gan newidiadau system. Gall rhai anwybyddu e-byst hir neu gymhleth, ac eraill fethu cyfarwyddiadau pwysig oni bai bod yr wybodaeth yn cael ei chyflwyno mewn ffordd glir, strwythuredig ac hawdd ei dilyn.

source: Your task is to send an internal announcement that explains what is changing and why the upgrade is happening now. The message should highlight the main benefits in plain, accessible language, clearly outline the key dates and expected downtime, guide staff through any required actions such as setting up two-factor authentication, and direct them to the appropriate place for help or training.
cy: Eich tasg yw anfon cyhoeddiad mewnol sy’n egluro beth sy’n newid a pham mae’r uwchraddiad yn digwydd nawr. Dylai’r neges amlygu’r prif fanteision mewn iaith syml a hygyrch, nodi’r dyddiadau allweddol a’r diffodd disgwyliedig, tywys staff drwy unrhyw gamau angenrheidiol megis gosod dilysu dau gam, ac yna eu cyfeirio at y lle iawn am gymorth neu hyfforddiant.

source: You want to use an AI assistant to help draft this announcement. Your goal is to write a prompt that gives the AI enough information to produce a clear, accurate, and reassuring message for colleagues with mixed levels of technical confidence.
cy: Rydych eisiau defnyddio cynorthwyydd AI i helpu llunio’r cyhoeddiad hwn. Eich nod yw ysgrifennu ciwb sy’n rhoi digon o wybodaeth i’r AI greu neges glir, gywir ac atyniadol i gydweithwyr ag amryw lefelau o hyder technegol.

source: Your prompt should include context about the organisation and the tools being upgraded, details about the audience, and constraints such as the desired tone—calm, supportive, and not alarmist—along with guidance on length and any specific policies, requirements, or wording the AI should follow or avoid.
cy: Dylai eich ciwb gynnwys cyd-destun am y sefydliad a’r offer sy’n cael eu huwchraddio, manylion am y gynulleidfa, a chyfyngiadau megis naws y neges—dawel, cefnogol, ac nid yn banigol—ynghyd â chanllawiau ar hyd y neges ac unrhyw bolisïau neu eiriad penodol y dylai’r AI ei ddilyn neu ei osgoi.

source: Hint: Imagine you are briefing a helpdesk engineer to write the announcement for you. What information would they need to ensure staff do not panic, do not ignore the message, and actually follow the steps?
cy: Awgrym: Dychmygwch eich bod yn briffio peiriannydd desg gymorth i ysgrifennu’r cyhoeddiad ar eich cyfer. Pa wybodaeth fyddai ei hangen arnynt i sicrhau nad yw staff yn panicio, nad ydyn nhw’n anwybyddu’r neges, ac yn dilyn y camau oddi yno?

source: Leaderboard · Prompt Scoring Arcade
cy: Tabl Sgorio · Arcêd Sgorio Ciwbiau

source: Prompt Leaderboard
cy: Tabl Sgorio Ciwbiau

source: High scores
cy: Sgorau uchel

source: Name
cy: Enw

source: Score
cy: Sgôr

source: Prompt Preview
cy: Rhagolwg o’r Ciwb

source: No prompts have been scored yet. Be the first to hit the arcade.
cy: Nid oes unrhyw giwbiau wedi’u sgorio eto. Byddwch chi’r cyntaf i fynd i’r arcêd.

source: Leaderboard · Prompt Scoring Arcade · v0.1
cy: Tabl Sgorio · Arcêd Sgorio Ciwbiau · f0.1

source: Your role: Marketing Strategist
cy: Eich rôl: Strategaeth Marchnata

source: Scenario · Campaign Planning · Go-To-Market
cy: Senario · Cynllunio Ymgyrch · Mynd-i’r-Farchnad

source: You are the Marketing Strategist for a B2B SaaS company that helps small and mid-sized businesses manage their projects and clients. The product team has just released a new AI-powered task assistant that can suggest priorities, draft updates, and flag risks directly inside the platform.
cy: Rydych chi’n Strategaeth Marchnata mewn cwmni SaaS B2B sy’n helpu busnesau bach a chanolig i reoli eu prosiectau a’u cleientiaid. Mae’r tîm cynnyrch wedi rhyddhau cynorthwyydd tasgau newydd sy’n cael ei bweru gan AI, sy’n gallu awgrymu blaenoriaethau, llunio diweddariadau ac amlygu risgiau yn y platfform ei hun.

source: In four weeks, you are running a launch campaign aimed at a mix of audiences. These include existing customers who may upgrade or expand their usage, new prospects who are currently comparing your tool with competing platforms, and partners or resellers who need a clear and compelling story to communicate to their clients.
cy: Ymhen pedair wythnos, rydych chi’n rhedeg ymgyrch lansio sy’n targedu cymysgedd o gynulleidfaoedd. Mae’r rhain yn cynnwys cwsmeriaid presennol a allai uwchraddio neu ehangu eu defnydd, rhagolygon newydd sy’n cymharu eich offer â chystadleuwyr, a phartneriaid neu ailwerthwyr sydd angen stori glir a chryf i’w chyfleu i’w cleientiaid.

source: You want to use an AI assistant to help outline the campaign. You will need ideas for the key value propositions and messaging angles that should resonate with each audience group, recommendations on which channels to use such as email, social posts, in-app messages, webinars, or landing pages, a simple timeline covering the four weeks leading up to the launch, and example content pieces such as subject lines, hooks, social copy, or webinar titles.
cy: Rydych am ddefnyddio cynorthwyydd AI i’ch helpu i amlinellu’r ymgyrch. Bydd angen syniadau arnoch ar gyfer prif werthoedd y cynnyrch a’r negeseuon sy’n apelio at bob cynulleidfa, ynghyd ag argymhellion ar ba sianeli i’w defnyddio—e-bost, cyfryngau cymdeithasol, negeseuon yn yr ap, gweminarau neu dudalennau glanio—yn ogystal ag amserlen syml ar gyfer y pedair wythnos cyn y lansiad, a darnau enghreifftiol megis teitlau, bachau a chopïau cymdeithasol.

source: Your task is to write a prompt that you would give to an AI assistant to help you generate this campaign plan. Your prompt should provide clear context about the product, outline the goals of the campaign, describe the target audiences, and include any constraints such as tone of voice, budget limitations, or required marketing channels.
cy: Eich tasg yw ysgrifennu ciwb y byddech yn ei roi i gynorthwyydd AI i’ch helpu i gynhyrchu’r cynllun ymgyrch. Dylai’ch ciwb ddarparu cyd-destun clir am y cynnyrch, amlinellu nodau’r ymgyrch, disgrifio’r cynulleidfaoedd targed, ac wedi hynny gynnwys unrhyw gyfyngiadau megis naws, cyllideb neu sianeli marchnata dethol.
