Repository: aronowen/prompty
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: Hint: Imagine you are briefing a freelance strategist who has never seen your brand before. What information would they need to produce a focused, realistic, and on-brand plan?
cy: Awgrym: Dychmygwch eich bod yn briffio strategaeth annibynnol nad yw erioed wedi gweld eich brand o’r blaen. Pa wybodaeth fyddai ei hangen arnynt i gynhyrchu cynllun realistig, canolbwyntiedig ac ar frand?

source: Your role: Product Designer
cy: Eich rôl: Dylunydd Cynnyrch

source: Scenario · UX Flow · Onboarding
cy: Senario · Llif UX · Ymuno Defnyddwyr

source: You want to use an AI assistant to help you think through this flow in detail. You would like the AI to propose a structured, step-by-step onboarding experience that outlines the narrative and messaging for each screen, identifies which UI elements should be highlighted or explained, suggests ways to keep the experience accessible and low-friction, and offers ideas for microcopy, tooltips, and helpful empty-state messages.
cy: Rydych eisiau defnyddio cynorthwyydd AI i’ch helpu i feddwl drwy’r llif hwn yn fanwl. Hoffech i’r AI awgrymu profiad ymuno strwythuredig, cam wrth gam sy’n amlinellu’r naratif a’r negeseuon ar bob sgrin, yn nodi pa elfennau UI ddylai gael eu hamlygu neu’u hesbonio, yn awgrymu ffyrdd o gadw’r profiad yn hygyrch ac yn esmwyth, ac yn cynnig syniadau ar gyfer micro-gopi, awgrymiadau ac ysgogiadau defnyddiol pan fydd y sgrin yn wag.

source: Your task is to write a prompt that you would give to an AI assistant to generate this onboarding flow. Your prompt should include clear product context, details about your target users, the goals of the redesign, and any constraints such as tone, platform requirements, visual style guidelines, or technical limitations.
cy: Eich tasg yw ysgrifennu ciwb y byddech yn ei roi i gynorthwyydd AI i gynhyrchu’r llif ymuno hwn. Dylai eich ciwb gynnwys cyd-destun clir am y cynnyrch, manylion am eich defnyddwyr targed, nodau’r ailgynllunio ac unrhyw gyfyngiadau megis naws, gofynion y platfform, canllawiau arddull weledol neu gyfyngiadau technegol.

source: Hint: Brief the AI as if you were handing the project over to another designer who has never seen your app. What information would they need to propose a realistic, user-centred onboarding flow?
cy: Awgrym: Briffiwch yr AI fel pe baech yn trosglwyddo’r prosiect i ddylunydd arall nad yw erioed wedi gweld eich ap o’r blaen. Pa wybodaeth fyddai ei hangen arno i awgrymu llif ymuno realistig sy’n canolbwyntio ar y defnyddiwr?

source: Result · Prompt Scoring Arcade
cy: Canlyniad · Arcêd Sgorio Ciwbiau

source: Your Score
cy: Eich Sgôr

source: Nice work, %(user_name)s. Here’s how your prompt performed.
cy: Da iawn, %(user_name)s. Dyma sut wnaeth eich ciwb berfformio.

source: Total Score
cy: Sgôr Cyfanswm

source: Higher scores mean clearer persona, task, context, and format.
cy: Mae sgoriau uwch yn golygu persona, tasg, cyd-destun a fformat llawer cliriach.

source: Play again
cy: Chwaraewch eto

source: View leaderboard
cy: Gweld y tabl sgorio

source: Your Prompt
cy: Eich Ciwb

source: Team · Prompt Scoring Arcade
cy: Tîm · Arcêd Sgorio Ciwbiau

source: Meet the Team
cy: Cyfarfod â’r Tîm

source: Powered by creativity, curiosity, and far too much caffeine.
cy: Wedi’i bweru gan greadigrwydd, chwilfrydedd, a gormod iawn o gaffein.

source: Digital Innovation Manager
cy: Rheolwr Arloesi Digidol

source: Creativity
cy: Creadigrwydd

source: Leadership
cy: Arweinyddiaeth

source: AI Expertise
cy: Arbenigedd AI

source: Coffee Consumption
cy: Defnydd o Goffi

source: Aron leads digital innovation at M-SParc: building tools, designing systems, managing clusters, running events, and somehow still finding time to build full applications on weekends for fun.
cy: Aron sy’n arwain arloesi digidol yn M-SParc: yn adeiladu offer, yn dylunio systemau, yn rheoli clwstyrau, yn trefnu digwyddiadau, ac rywsut dal yn dod o hyd i amser i adeiladu apiau llawn ar y penwythnosau er mwyn hwyl.

source: Degree Apprentice
cy: Prentis Gradd

source: Problem Solving
cy: Datrys Problemau

source: Coding Speed
cy: Cyflymder Codio

source: Debugging Luck
cy: Lwc Dadfygio

source: Snack Efficiency
cy: Effeithlonrwydd Byrbrydau

source: Elgan is the engine behind many of the digital projects — building, testing, learning, and improving at breakneck speed. He is known for writing code that works on the first try… sometimes.
cy: Elgan yw’r injan y tu ôl i lawer o’r prosiectau digidol — yn adeiladu, yn profi, yn dysgu ac yn gwella ar gyflymder brawychus. Mae’n enwog am ysgrifennu cod sy’n gweithio’r tro cyntaf… weithiau.

source: Digital Innovation Officer
cy: Swyddog Arloesi Digidol

source: Tinkering
cy: Tincro

source: Vibe Coding
cy: Codio vibe

source: Curiosity Level
cy: Lefel Cwestiynu

source: Coffee Dependency
cy: Ddibyniaeth ar goffi

source: Jordan is Ar y Lôn — the team's resident tinkerer and vibe coder. Whether experimenting with emerging tech, wiring prototypes, or turning vague ideas into working demos, Jordan brings curiosity, energy, and a hands-on spirit that keeps the innovation engine running.
cy: Jordan yw Ar y Lôn — tincerwr a chodwr vibe preswyl y tîm. Boed yn arbrofi gyda thechnoleg newydd, yn gwifrau prototeipiau neu’n troi syniadau niwlog yn ddemos sy’n gweithio, mae Jordan yn dod â chwilfrydedd, ynni ac ysbryd ymlaen-llaw sy’n cadw’r peiriant arloesi i redeg.
